worker.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <env:Header>
        <wsse:Security
        env:mustUnderstand="1"
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-86F2FCCEFFBB80C4CD14820998755791">
                <wsse:Username></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"></wsse:Password>
                <wsse:Nonce
                EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">asdfwrqwarqwr1+oA==
            </wsse:Nonce>
                <wsu:Created>2016-12-18T22:24:30.575Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </env:Header>
    <env:Body>
        <wd:Get_Workers_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v35.2">
            <wd:Request_References
                wd:Skip_Non_Existing_Instances="true"
                wd:Ignore_Invalid_References="true">
                <wd:Worker_Reference>
                    <!-- <wd:ID wd:type="Employee_ID">C101189</wd:ID> -->
                    <wd:ID wd:type="Contingent_Worker_ID">C101189</wd:ID>
                </wd:Worker_Reference>
            </wd:Request_References>
            <wd:Request_Criteria>
            </wd:Request_Criteria>
            <wd:Response_Filter>
                <wd:As_Of_Effective_Date>2021-05-05</wd:As_Of_Effective_Date>
                <wd:As_Of_Entry_DateTime>2021-05-05T08:35:28</wd:As_Of_Entry_DateTime>
                <wd:Page>1</wd:Page>
                <wd:Count>100</wd:Count>
            </wd:Response_Filter>
            <wd:Response_Group>
                <wd:Include_Reference>true</wd:Include_Reference>
                <wd:Include_Personal_Information>true</wd:Include_Personal_Information>
                <wd:Include_Additional_Jobs>true</wd:Include_Additional_Jobs>
                <wd:Include_Employment_Information>true</wd:Include_Employment_Information>
                <wd:Include_Compensation>true</wd:Include_Compensation>
                <wd:Include_Organizations>true</wd:Include_Organizations>
                <wd:Exclude_Organization_Support_Role_Data>true</wd:Exclude_Organization_Support_Role_Data>
                <wd:Exclude_Location_Hierarchies>true</wd:Exclude_Location_Hierarchies>
                <wd:Exclude_Cost_Centers>true</wd:Exclude_Cost_Centers>
                <wd:Exclude_Cost_Center_Hierarchies>true</wd:Exclude_Cost_Center_Hierarchies>
                <wd:Exclude_Companies>true</wd:Exclude_Companies>
                <wd:Exclude_Company_Hierarchies>true</wd:Exclude_Company_Hierarchies>
                <wd:Exclude_Matrix_Organizations>true</wd:Exclude_Matrix_Organizations>
                <wd:Exclude_Pay_Groups>true</wd:Exclude_Pay_Groups>
                <wd:Exclude_Regions>true</wd:Exclude_Regions>
                <wd:Exclude_Region_Hierarchies>true</wd:Exclude_Region_Hierarchies>
                <wd:Exclude_Supervisory_Organizations>true</wd:Exclude_Supervisory_Organizations>
                <wd:Exclude_Teams>true</wd:Exclude_Teams>
                <wd:Exclude_Custom_Organizations>true</wd:Exclude_Custom_Organizations>
                <wd:Include_Roles>true</wd:Include_Roles>
                <wd:Include_Management_Chain_Data>true</wd:Include_Management_Chain_Data>
                <wd:Include_Multiple_Managers_in_Management_Chain_Data>true</wd:Include_Multiple_Managers_in_Management_Chain_Data>
                <wd:Include_Benefit_Enrollments>true</wd:Include_Benefit_Enrollments>
                <wd:Include_Benefit_Eligibility>true</wd:Include_Benefit_Eligibility>
                <wd:Include_Related_Persons>true</wd:Include_Related_Persons>
                <wd:Include_Qualifications>true</wd:Include_Qualifications>
                <wd:Include_Employee_Review>true</wd:Include_Employee_Review>
                <wd:Include_Goals>true</wd:Include_Goals>
                <wd:Include_Development_Items>true</wd:Include_Development_Items>
                <wd:Include_Skills>true</wd:Include_Skills>
                <wd:Include_Photo>true</wd:Include_Photo>
                <wd:Include_Worker_Documents>true</wd:Include_Worker_Documents>
                <wd:Include_Transaction_Log_Data>true</wd:Include_Transaction_Log_Data>
                <wd:Include_Subevents_for_Corrected_Transaction>true</wd:Include_Subevents_for_Corrected_Transaction>
                <wd:Include_Subevents_for_Rescinded_Transaction>true</wd:Include_Subevents_for_Rescinded_Transaction>
                <wd:Include_Succession_Profile>true</wd:Include_Succession_Profile>
                <wd:Include_Talent_Assessment>true</wd:Include_Talent_Assessment>
                <wd:Include_Employee_Contract_Data>true</wd:Include_Employee_Contract_Data>
                <wd:Include_Contracts_for_Terminated_Workers>true</wd:Include_Contracts_for_Terminated_Workers>
                <wd:Include_Collective_Agreement_Data>true</wd:Include_Collective_Agreement_Data>
                <wd:Include_Probation_Period_Data>true</wd:Include_Probation_Period_Data>
                <wd:Include_Extended_Employee_Contract_Details>true</wd:Include_Extended_Employee_Contract_Details>
                <wd:Include_Feedback_Received>true</wd:Include_Feedback_Received>
                <wd:Include_User_Account>true</wd:Include_User_Account>
                <wd:Include_Career>true</wd:Include_Career>
                <wd:Include_Account_Provisioning>true</wd:Include_Account_Provisioning>
                <wd:Include_Background_Check_Data>true</wd:Include_Background_Check_Data>
                <wd:Include_Contingent_Worker_Tax_Authority_Form_Information>true</wd:Include_Contingent_Worker_Tax_Authority_Form_Information>
                <wd:Exclude_Funds>true</wd:Exclude_Funds>
                <wd:Exclude_Fund_Hierarchies>true</wd:Exclude_Fund_Hierarchies>
                <wd:Exclude_Grants>true</wd:Exclude_Grants>
                <wd:Exclude_Grant_Hierarchies>true</wd:Exclude_Grant_Hierarchies>
                <wd:Exclude_Business_Units>true</wd:Exclude_Business_Units>
                <wd:Exclude_Business_Unit_Hierarchies>true</wd:Exclude_Business_Unit_Hierarchies>
                <wd:Exclude_Programs>true</wd:Exclude_Programs>
                <wd:Exclude_Program_Hierarchies>true</wd:Exclude_Program_Hierarchies>
                <wd:Exclude_Gifts>true</wd:Exclude_Gifts>
                <wd:Exclude_Gift_Hierarchies>true</wd:Exclude_Gift_Hierarchies>
            </wd:Response_Group>
        </wd:Get_Workers_Request>
    </env:Body>
</env:Envelope>
